Repository: oriveo/oriveo
Catalog: ios/Oriveo/Oriveo/Skills.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, id, ja, ko, pt_br, ru, th, tr, vi, zh_hans, zh_hant

source: Add file
ar: إضافة ملف
de: Datei hinzufügen
es: Agregar archivo
fr: Ajouter un fichier
hi: फ़ाइल जोड़ें
id: Tambahkan berkas
ja: ファイルを追加
ko: 파일 추가
pt_br: Adicionar arquivo
ru: Добавить файл
th: เพิ่มไฟล์
tr: Dosya ekle
vi: Thêm tập tin
zh_hans: 添加文件
zh_hant: 新增檔案

source: Brief description
ar: وصف مختصر
de: Kurzbeschreibung
es: Descripción breve
fr: Description brève
hi: संक्षिप्त विवरण
id: Deskripsi singkat
ja: 簡単な説明
ko: 간단한 설명
pt_br: Descrição breve
ru: Краткое описание
th: คำอธิบายสั้น ๆ
tr: Kısa açıklama
vi: Mô tả ngắn gọn
zh_hans: 简要描述
zh_hant: 簡要描述

source: Built-in Skills
ar: المهارات المدمجة
de: Eingebaute Fähigkeiten
es: Habilidades integradas
fr: Compétences intégrées
hi: अंतर्निहित कौशल
id: Keterampilan Bawaan
ja: ビルトインスキル
ko: 기본 스킬
pt_br: Habilidades integradas
ru: Встроенные навыки
th: ทักษะในตัว
tr: Yerleşik Beceriler
vi: Kỹ năng tích hợp
zh_hans: 内置技能
zh_hant: 內建技能

source: Configure model preferences and memory injection.
ar: تكوين تفضيلات النموذج وحقن الذاكرة.
de: Modellpräferenzen und Gedächtnis-Injektion konfigurieren.
es: Configurar preferencias de modelo e inyección de memoria.
fr: Configurer les préférences de modèle et l'injection de mémoire.
hi: मॉडल प्राथमिकताएँ और मेमोरी इंजेक्शन कॉन्फ़िगर करें।
id: Konfigurasikan preferensi model dan injeksi memori.
ja: モデル設定とメモリー注入を構成します。
ko: 모델 환경설정 및 메모리 주입을 구성합니다.
pt_br: Configurar preferências de modelo e injeção de memória.
ru: Настройте предпочтения модели и внедрение памяти.
th: กำหนดค่าการกำหนดลักษณะโมเดลและการแทรกหน่วยความจำ
tr: Model tercihlerini ve bellek enjeksiyonunu yapılandırın.
vi: Định cấu hình tùy chọn mô hình và chèn bộ nhớ.
zh_hans: 配置模型偏好和记忆注入等进阶选项。
zh_hant: 配置模型偏好和記憶注入等進階選項。

source: Create your first Skill
ar: أنشئ مهارتك الأولى
de: Erstelle deine erste Fähigkeit
es: Crea tu primera habilidad
fr: Créez votre première compétence
hi: अपना पहला कौशल बनाएं
id: Buat Keterampilan pertama Anda
ja: 最初のスキルを作成
ko: 첫 번째 스킬 만들기
pt_br: Crie sua primeira habilidade
ru: Создайте свой первый навык
th: สร้างทักษะแรกของคุณ
tr: İlk Becerinizi oluşturun
vi: Tạo kỹ năng đầu tiên của bạn
zh_hans: 创建你的第一个技能
zh_hant: 建立你的第一個技能

source: Delete Skill?
ar: حذف المهارة؟
de: Fähigkeit löschen?
es: ¿Eliminar habilidad?
fr: Supprimer la compétence ?
hi: कौशल हटाएँ?
id: Hapus Keterampilan?
ja: スキルを削除しますか？
ko: 스킬을 삭제하시겠습니까?
pt_br: Excluir habilidade?
ru: Удалить навык?
th: ลบทักษะ?
tr: Beceri Silinsin mi?
vi: Xóa kỹ năng?
zh_hans: 删除技能？
zh_hant: 刪除技能？

source: Discard Changes?
ar: تجاهل التغييرات؟
de: Änderungen verwerfen?
es: ¿Descartar cambios?
fr: Abandonner les modifications ?
hi: परिवर्तनों को निरस्त करें?
id: Buang Perubahan?
ja: 変更を破棄しますか？
ko: 변경사항을 삭제하시겠습니까?
pt_br: Descartar alterações?
ru: Отменить изменения?
th: ยกเลิกการเปลี่ยนแปลงใช่ไหม
tr: Değişiklikler Silinsin mi?
vi: Hủy thay đổi?
zh_hans: 丢弃更改？
zh_hant: 捨棄變更？

source: Edit Skill
ar: تعديل المهارة
de: Fähigkeit bearbeiten
es: Editar habilidad
fr: Modifier la compétence
hi: कौशल संपादित करें
id: Sunting Keterampilan
ja: スキルを編集
ko: 스킬 편집
pt_br: Editar habilidade
ru: Изменить навык
th: แก้ไขทักษะ
tr: Beceriyi Düzenle
vi: Chỉnh sửa kỹ năng
zh_hans: 编辑技能
zh_hant: 編輯技能

source: Emoji Icon
ar: رمز Emoji
de: Emoji-Symbol
es: Ícono Emoji
fr: Icône Emoji
hi: इमोजी आइकन
id: Ikon Emoji
ja: Emoji アイコン
ko: 이모지 아이콘
pt_br: Ícone Emoji
ru: Иконка Эмодзи
th: ไอคอนเอโมจิ
tr: Emoji Simgesi
vi: Biểu tượng cảm xúc
zh_hans: Emoji 图标
zh_hant: Emoji 圖示

source: Enable %@ in your OpenAI provider to use Knowledge Base.
ar: فعّل %@ في مزود OpenAI لديك لاستخدام قاعدة المعرفة.
de: Aktivieren Sie %@ in Ihrem OpenAI-Anbieter, um die Wissensdatenbank zu verwenden.
es: Activa %@ en tu proveedor de OpenAI para usar la base de conocimientos.
fr: Activez %@ dans votre fournisseur OpenAI pour utiliser la base de connaissances.
hi: Knowledge Base उपयोग करने के लिए अपने OpenAI प्रदाता में %@ सक्षम करें।
id: Aktifkan %@ di penyedia OpenAI Anda untuk menggunakan Knowledge Base.
ja: Knowledge Base を使うには、OpenAI プロバイダで %@ を有効にしてください。
ko: Knowledge Base를 사용하려면 OpenAI 제공업체에서 %@를 활성화하세요.
pt_br: Ative %@ no seu provedor OpenAI para usar a base de conhecimento.
ru: Чтобы использовать Knowledge Base, включите %@ у своего провайдера OpenAI.
th: เปิดใช้ %@ ในผู้ให้บริการ OpenAI ของคุณเพื่อใช้ Knowledge Base
tr: Knowledge Base kullanmak için OpenAI sağlayıcında %@ özelliğini etkinleştir.
vi: Bật %@ trong nhà cung cấp OpenAI của bạn để dùng Knowledge Base.
zh_hans: 要使用知识库，请先在 OpenAI provider 中启用 %@。
zh_hant: 要使用知識庫，請先在 OpenAI provider 中啟用 %@。

source: Failed
ar: فشل
de: Fehlgeschlagen
es: Error
fr: Échec
hi: विफल
id: Gagal
ja: 失敗
ko: 실패
pt_br: Falhou
ru: Ошибка
th: ล้มเหลว
tr: Başarısız
vi: Thất bại
zh_hans: 失败
zh_hant: 失敗

source: File is empty
ar: الملف فارغ
de: Datei ist leer
es: El archivo está vacío
fr: Le fichier est vide
hi: फ़ाइल खाली है
id: Berkas kosong
ja: ファイルが空です
ko: 파일이 비어 있습니다
pt_br: O arquivo está vazio
ru: Файл пуст
th: ไฟล์ว่างเปล่า
tr: Dosya boş
vi: Tệp trống
zh_hans: 文件内容为空
zh_hant: 檔案內容為空

source: Fork as My Skill
ar: نسخ كمهارتي
de: Als eigene Fähigkeit kopieren
es: Duplicar como mi habilidad
fr: Dupliquer comme ma compétence
hi: मेरे कौशल के रूप में कांटा
id: Garpu sebagai Keahlianku
ja: マイスキルとして複製
ko: 내 스킬로 복제
pt_br: Duplicar como minha habilidade
ru: Форк как мой навык
th: ส้อมเป็นทักษะของฉัน
tr: Benim Becerim Olarak Çatal
vi: Ngã ba là kỹ năng của tôi
zh_hans: 复制为我的技能
zh_hant: 複製為我的技能

source: Include your personal preferences in conversations
ar: تضمين تفضيلاتك الشخصية في المحادثات
de: Persönliche Einstellungen in Gespräche einbeziehen
es: Incluir tus preferencias personales en las conversaciones
fr: Inclure vos préférences personnelles dans les conversations
hi: बातचीत में अपनी व्यक्तिगत प्राथमिकताओं को शामिल करें
id: Sertakan preferensi pribadi Anda dalam percakapan
ja: 会話にあなたの個人設定を含める
ko: 대화에 개인 환경설정 포함
pt_br: Incluir suas preferências pessoais nas conversas
ru: Включайте свои личные предпочтения в разговоры
th: รวมความชอบส่วนตัวของคุณในการสนทนา
tr: Kişisel tercihlerinizi konuşmalara dahil edin
vi: Đưa sở thích cá nhân của bạn vào cuộc trò chuyện
zh_hans: 在对话中包含你的个人偏好设置
zh_hant: 在對話中包含你的個人偏好設定

source: Info
ar: معلومات
hi: जानकारी
id: Informasi
ja: 情報
ko: 정보
ru: Информация
th: ข้อมูล
tr: Bilgi
vi: Thông tin
zh_hans: 提示
zh_hant: 提示

source: Model Preference
ar: تفضيل النموذج
de: Modellpräferenz
es: Preferencia de modelo
fr: Préférence de modèle
hi: मॉडल प्राथमिकता
id: Preferensi Model
ja: モデル設定
ko: 모델 선호
pt_br: Preferência de modelo
ru: Предпочтение модели
th: การตั้งค่าโมเดล
tr: Model Tercihi
vi: Ưu tiên người mẫu
zh_hans: 模型偏好
zh_hant: 模型偏好

source: My Skills
ar: مهاراتي
de: Meine Fähigkeiten
es: Mis habilidades
fr: Mes compétences
hi: मेरा कौशल
id: Keterampilan saya
ja: マイスキル
ko: 내 스킬
pt_br: Minhas habilidades
ru: Мои навыки
th: ทักษะของฉัน
tr: Becerilerim
vi: Kỹ năng của tôi
zh_hans: 我的技能
zh_hant: 我的技能

source: New Skill
ar: مهارة جديدة
de: Neue Fähigkeit
es: Nueva habilidad
fr: Nouvelle compétence
hi: नया कौशल
id: Keterampilan Baru
ja: 新規スキル
ko: 새 스킬
pt_br: Nova habilidade
ru: Новый навык
th: ทักษะใหม่
tr: Yeni Beceri
vi: Kỹ năng mới
zh_hans: 新建技能
zh_hant: 新增技能

source: No custom Skills yet
ar: لا توجد مهارات مخصصة بعد
de: Noch keine eigenen Fähigkeiten
es: Aún no hay habilidades personalizadas
fr: Pas encore de compétences personnalisées
hi: अभी तक कोई कस्टम कौशल नहीं
id: Belum ada Keterampilan khusus
ja: カスタムスキルはまだありません
ko: 아직 커스텀 스킬이 없습니다
pt_br: Nenhuma habilidade personalizada ainda
ru: Пользовательских навыков пока нет.
th: ยังไม่มีทักษะที่กำหนดเอง
tr: Henüz özel Beceri yok
vi: Chưa có kỹ năng tùy chỉnh nào
zh_hans: 还没有自定义技能
zh_hant: 尚無自訂技能

source: No reference materials yet
ar: لا توجد مواد مرجعية بعد
de: Noch kein Referenzmaterial
es: Sin materiales de referencia aún
fr: Pas encore de documents de référence
hi: अभी तक कोई संदर्भ सामग्री नहीं
id: Belum ada bahan referensi
ja: 参考資料はまだありません
ko: 참고 자료 없음
pt_br: Nenhum material de referência ainda
ru: Справочных материалов пока нет
th: ยังไม่มีเอกสารอ้างอิง
tr: Henüz referans materyali yok
vi: Chưa có tài liệu tham khảo
zh_hans: 暂无参考资料
zh_hant: 暫無參考資料

source: Pin to Home
ar: تثبيت في الرئيسية
de: An Startseite anheften
es: Fijar en inicio
fr: Épingler à l'accueil
hi: होम पर पिन करें
id: Sematkan ke Beranda
ja: ホームにピン留め
ko: 홈에 고정
pt_br: Fixar na página inicial
ru: Закрепить на главной странице
th: ปักหมุดไปที่หน้าแรก
tr: Ana Sayfaya Sabitle
vi: Ghim vào Trang chủ
zh_hans: 固定到首页
zh_hant: 釘選到首頁

source: Prompt
ar: الأوامر
hi: तत्पर
id: Mengingatkan
ja: プロンプト
ko: 프롬프트
ru: Быстрый
th: พรอมต์
tr: Çabuk
vi: Lời nhắc
zh_hans: 提示词
zh_hant: 提示詞

source: Reference Materials
ar: مواد مرجعية
de: Referenzmaterial
es: Materiales de referencia
fr: Documents de référence
hi: संदर्भ सामग्री
id: Bahan Referensi
ja: 参考資料
ko: 참고 자료
pt_br: Materiais de referência
ru: Справочные материалы
th: วัสดุอ้างอิง
tr: Referans Materyalleri
vi: Tài liệu tham khảo
zh_hans: 参考资料
zh_hant: 參考資料

source: Remember Preferences
ar: تذكر التفضيلات
de: Einstellungen merken
es: Recordar preferencias
fr: Mémoriser les préférences
hi: प्राथमिकताएँ याद रखें
id: Ingat Preferensi
ja: 設定を記憶
ko: 환경설정 기억
pt_br: Lembrar preferências
ru: Запомнить предпочтения
th: จำการตั้งค่า
tr: Tercihleri ​​Hatırla
vi: Ghi nhớ sở thích
zh_hans: 记住我的偏好
zh_hant: 記住我的偏好

source: Search Skills
ar: البحث عن المهارات
de: Fähigkeiten suchen
es: Buscar habilidades
fr: Rechercher des compétences
hi: खोज कौशल
id: Keterampilan Pencarian
ja: スキルを検索
ko: 스킬 검색
pt_br: Buscar habilidades
ru: Навыки поиска
th: ทักษะการค้นหา
tr: Arama Becerileri
vi: Kỹ năng tìm kiếm
zh_hans: 搜索技能
zh_hant: 搜尋技能

source: Skill Name
ar: اسم المهارة
de: Name der Fähigkeit
es: Nombre de la habilidad
fr: Nom de la compétence
hi: कौशल का नाम
id: Nama Keterampilan
ja: スキル名
ko: 스킬 이름
pt_br: Nome da habilidade
ru: Название навыка
th: ชื่อทักษะ
tr: Beceri Adı
vi: Tên kỹ năng
zh_hans: 技能名称
zh_hant: 技能名稱

source: The AI reads these files in full every time it replies — like notes it always has open on its desk. Best for short, essential documents (style guides, glossaries, key rules). Larger files will increase response cost.
ar: يقرأ الذكاء الاصطناعي هذه الملفات بالكامل في كل مرة يرد فيها — كأنها ملاحظات مفتوحة دائمًا على مكتبه. مناسبة للمستندات القصيرة والأساسية (أدلة الأسلوب، المسارد، القواعد الرئيسية). الملفات الأكبر ستزيد تكلفة الاستجابة.
de: Die KI liest diese Dateien bei jeder Antwort vollständig — wie Notizen, die immer aufgeschlagen auf dem Schreibtisch liegen. Am besten für kurze, wichtige Dokumente (Stilrichtlinien, Glossare, zentrale Regeln). Größere Dateien erhöhen die Antwortkosten.
es: La IA lee estos archivos completos cada vez que responde, como notas que siempre tiene abiertas en su escritorio. Ideal para documentos breves y esenciales (guías de estilo, glosarios, reglas clave). Los archivos más grandes aumentarán el costo de respuesta.
fr: L'IA lit ces fichiers en entier à chaque réponse — comme des notes toujours ouvertes sur son bureau. Idéal pour les documents courts et essentiels (guides de style, glossaires, règles clés). Les fichiers plus volumineux augmenteront le coût de réponse.
hi: AI हर बार जवाब देते समय इन फ़ाइलों को पूरा पढ़ता है — जैसे उसकी मेज़ पर हमेशा खुले नोट्स। छोटे, ज़रूरी दस्तावेज़ों के लिए सबसे अच्छा (स्टाइल गाइड, शब्दावली, मुख्य नियम)। बड़ी फ़ाइलें प्रतिक्रिया लागत बढ़ाएँगी।
id: AI membaca file-file ini secara lengkap setiap kali membalas — seperti catatan yang selalu terbuka di mejanya. Paling cocok untuk dokumen singkat dan penting (panduan gaya, glosarium, aturan utama). File yang lebih besar akan meningkatkan biaya respons.
ja: AIは返答のたびにこれらのファイルを全文読み込みます。デスクに常に開いてあるメモのようなものです。短く重要なドキュメント（スタイルガイド、用語集、主要ルール）に最適です。ファイルが大きいほど応答コストが増加します。
ko: AI는 답변할 때마다 이 파일들을 전체 읽습니다 — 책상 위에 항상 펼쳐놓은 메모와 같습니다. 짧고 핵심적인 문서(스타일 가이드, 용어집, 주요 규칙)에 적합합니다. 파일이 클수록 응답 비용이 증가합니다.
pt_br: A IA lê esses arquivos por completo toda vez que responde — como anotações sempre abertas em sua mesa. Ideal para documentos curtos e essenciais (guias de estilo, glossários, regras importantes). Arquivos maiores aumentarão o custo de resposta.
ru: ИИ читает эти файлы полностью при каждом ответе — как заметки, всегда открытые на его столе. Лучше всего подходит для коротких, важных документов (руководства по стилю, глоссарии, ключевые правила). Более крупные файлы увеличат стоимость ответа.
th: AI จะอ่านไฟล์เหล่านี้ทั้งหมดทุกครั้งที่ตอบ เหมือนบันทึกที่เปิดไว้บนโต๊ะเสมอ เหมาะสำหรับเอกสารสั้นที่สำคัญ (คู่มือสไตล์ อภิธานศัพท์ กฎหลัก) ไฟล์ขนาดใหญ่จะเพิ่มต้นทุนการตอบ
tr: Yapay zeka her yanıt verdiğinde bu dosyaları tamamen okur — masasında her zaman açık duran notlar gibi. Kısa ve önemli belgeler (stil kılavuzları, sözlükler, temel kurallar) için idealdir. Daha büyük dosyalar yanıt maliyetini artırır.
vi: AI đọc toàn bộ các tệp này mỗi lần trả lời — như ghi chú luôn mở trên bàn làm việc. Phù hợp nhất cho tài liệu ngắn, quan trọng (hướng dẫn phong cách, bảng thuật ngữ, quy tắc chính). Tệp lớn hơn sẽ tăng chi phí phản hồi.
zh_hans: AI 每次回复都会完整读取这些文件，就像它桌上始终打开的笔记。适合简短、重要的文档（如风格指南、术语表、核心规则）。文件越大，每次对话费用越高。
zh_hant: AI 每次回覆都會完整讀取這些檔案，就像它桌上始終打開的筆記。適合簡短、重要的文件（如風格指南、詞彙表、核心規則）。檔案越大，每次對話費用越高。

source: This Skill will be permanently deleted.
ar: سيتم حذف هذه المهارة نهائياً.
de: Diese Fähigkeit wird dauerhaft gelöscht.
es: Esta habilidad se eliminará permanentemente.
fr: Cette compétence sera définitivement supprimée.
hi: यह कौशल स्थायी रूप से हटा दिया जाएगा.
id: Skill ini akan dihapus secara permanen.
ja: このスキルは完全に削除されます。
ko: 이 스킬은 영구적으로 삭제됩니다.
pt_br: Esta habilidade será excluída permanentemente.
ru: Этот навык будет удален навсегда.
th: ทักษะนี้จะถูกลบอย่างถาวร
tr: Bu Beceri kalıcı olarak silinecek.
vi: Kỹ năng này sẽ bị xóa vĩnh viễn.
zh_hans: 该技能将被永久删除。
zh_hant: 該技能將被永久刪除。

source: Unpin
ar: إلغاء التثبيت
de: Loslösen
es: Desfijar
fr: Désépingler
hi: अनपिन
id: Membuka peniti
ja: ピン留めを解除
ko: 고정 해제
pt_br: Desafixar
ru: Открепить
th: เลิกปักหมุด
tr: Sabitlemeyi kaldır
vi: Bỏ ghim
zh_hans: 取消固定
zh_hant: 取消釘選

source: Use this Skill
ar: استخدام هذه المهارة
de: Diese Fähigkeit verwenden
es: Usar esta habilidad
fr: Utiliser cette compétence
hi: इस कौशल का प्रयोग करें
id: Gunakan Keterampilan ini
ja: このスキルを使用
ko: 이 스킬 사용
pt_br: Usar esta habilidade
ru: Используйте этот навык
th: ใช้ทักษะนี้
tr: Bu Beceriyi Kullan
vi: Sử dụng kỹ năng này
zh_hans: 使用此技能
zh_hant: 使用此技能

source: Write instructions that define how the AI behaves — its personality, expertise, and response style. Only the AI sees this, users won't.
ar: يحدد كيف يتصرف الذكاء الاصطناعي — شخصيته وخبرته وأسلوب الرد. فقط الذكاء الاصطناعي يرى هذا، المستخدمون لا يرونه.
de: Definiert das Verhalten der KI — Persönlichkeit, Expertise und Antwortstil. Nur die KI sieht dies, Benutzer nicht.
es: Define cómo se comporta la IA — su personalidad, experiencia y estilo de respuesta. Solo la IA lo ve, los usuarios no.
fr: Définit le comportement de l’IA — sa personnalité, son expertise et son style de réponse. Seule l’IA voit ceci, pas les utilisateurs.
hi: ऐसे निर्देश लिखें जो परिभाषित करें कि एआई कैसे व्यवहार करता है - इसका व्यक्तित्व, विशेषज्ञता और प्रतिक्रिया शैली। केवल AI इसे देखता है, उपयोगकर्ता नहीं देखेंगे।
id: Tulis instruksi yang menjelaskan bagaimana AI berperilaku — kepribadian, keahlian, dan gaya responsnya. Hanya AI yang melihat ini, pengguna tidak.
ja: AIの振る舞いを定義します——性格、専門分野、回答スタイルなど。AIだけが見ることができ、ユーザーには表示されません。
ko: AI의 행동을 정의합니다 — 성격, 전문 분야, 응답 스타일 등. AI만 볼 수 있으며 사용자에게는 표시되지 않습니다.
pt_br: Define como a IA se comporta — personalidade, expertise e estilo de resposta. Apenas a IA vê isso, os usuários não.
ru: Напишите инструкции, определяющие поведение ИИ — его личность, опыт и стиль реагирования. Это видит только ИИ, пользователи нет.
th: เขียนคำแนะนำที่กำหนดลักษณะการทำงานของ AI เช่น บุคลิกภาพ ความเชี่ยวชาญ และรูปแบบการตอบสนอง มีเพียง AI เท่านั้นที่เห็นสิ่งนี้ ผู้ใช้จะไม่เห็น
tr: Yapay zekanın nasıl davranacağını (kişiliğini, uzmanlığını ve tepki stilini) tanımlayan talimatları yazın. Bunu yalnızca yapay zeka görüyor, kullanıcılar göremiyor.
vi: Viết hướng dẫn xác định cách AI hoạt động - tính cách, chuyên môn và phong cách phản ứng của nó. Chỉ AI mới thấy điều này, người dùng thì không.
zh_hans: 定义 AI 的行为方式——性格、专长和回复风格。只有 AI 能看到，用户看不到。
zh_hant: 定義 AI 的行為方式——個性、專長和回覆風格。只有 AI 能看到，使用者看不到。

source: You have unsaved changes. Are you sure you want to discard them?
ar: لديك تغييرات غير محفوظة. هل أنت متأكد من أنك تريد تجاهلها؟
de: Du hast nicht gespeicherte Änderungen. Bist du sicher, dass du sie verwerfen möchtest?
es: Tienes cambios sin guardar. ¿Estás seguro de que quieres descartarlos?
fr: Vous avez des modifications non enregistrées. Êtes-vous sûr de vouloir les abandonner ?
hi: आपके पास सहेजे नहीं गए परिवर्तन हैं. क्या आप वाकई उन्हें त्यागना चाहते हैं?
id: Anda memiliki perubahan yang belum disimpan. Apakah Anda yakin ingin membuangnya?
ja: 保存されていない変更があります。破棄してもよろしいですか？
ko: 저장되지 않은 변경사항이 있습니다. 정말 삭제하시겠습니까?
pt_br: Você tem alterações não salvas. Tem certeza de que deseja descartá-las?
ru: У вас есть несохраненные изменения. Вы уверены, что хотите их удалить?
th: คุณมีการเปลี่ยนแปลงที่ยังไม่ได้บันทึก คุณแน่ใจหรือไม่ว่าต้องการยกเลิก
tr: Kaydedilmemiş değişiklikleriniz var. Bunları silmek istediğinizden emin misiniz?
vi: Bạn có những thay đổi chưa được lưu. Bạn có chắc chắn muốn loại bỏ chúng không?
zh_hans: 你有未保存的更改。确定要丢弃吗？
zh_hant: 你有未儲存的變更。確定要捨棄嗎？

# openai_not_configured
source: Add and configure an OpenAI provider first.
ar: تتطلب قاعدة المعرفة مفتاح OpenAI API الرسمي.
de: Für die Wissensdatenbank ist ein offizieller OpenAI-API-Schlüssel erforderlich.
es: La base de conocimientos requiere una clave API oficial de OpenAI.
fr: La base de connaissances nécessite une clé API OpenAI officielle.
hi: पहले एक OpenAI प्रदाता जोड़ें और कॉन्फ़िगर करें।
id: Tambahkan dan konfigurasikan penyedia OpenAI terlebih dahulu.
ja: ナレッジベースには、公式の OpenAI API キーが必要です。
ko: 기술 자료에는 공식 OpenAI API 키가 필요합니다.
pt_br: A Base de Conhecimento requer uma chave oficial da API OpenAI.
ru: Сначала добавьте и настройте провайдера OpenAI.
th: โปรดเพิ่มและตั้งค่าผู้ให้บริการ OpenAI ก่อน
tr: Önce bir OpenAI sağlayıcısı ekleyip yapılandır.
vi: Trước tiên hãy thêm và cấu hình nhà cung cấp OpenAI.
zh_hans: Skill 知识库需要官方 OpenAI API Key。
zh_hant: Skill 知識庫需要官方 OpenAI API Key。

source: Confirm Model Controls
ar: تأكيد عناصر التحكم بالنموذج
de: Modellsteuerung bestätigen
es: Confirmar controles del modelo
fr: Confirmer les contrôles du modèle
hi: मॉडल नियंत्रण की पुष्टि करें
id: Konfirmasi kontrol model
ja: モデル設定を確認
ko: 모델 제어 확인
pt_br: Confirmar controles do modelo
ru: Подтвердить управление моделью
th: ยืนยันการควบคุมโมเดล
tr: Model denetimlerini onayla
vi: Xác nhận điều khiển mô hình
zh_hans: 确认模型控制
zh_hant: 確認模型控制

source: Apply this Skill's saved web and reasoning preferences in new Skill chats.
ar: تطبيق تفضيلات الويب والاستدلال المحفوظة لهذه الـ Skill في محادثات Skill الجديدة.
de: Die gespeicherten Web- und Reasoning-Einstellungen dieser Skill in neuen Skill-Chats anwenden.
es: Aplica las preferencias de web y razonamiento guardadas de esta Skill en los nuevos chats de Skill.
fr: Appliquer les préférences web et de raisonnement enregistrées de cette Skill aux nouvelles conversations Skill.
hi: नई Skill चैट में इस Skill की सहेजी गई वेब और रीज़निंग प्राथमिकताएँ लागू करें।
id: Terapkan preferensi web dan penalaran tersimpan dari Skill ini di obrolan Skill baru.
ja: この Skill に保存されたネット検索と思考の設定を、新しい Skill の会話に適用します。
ko: 이 Skill에 저장된 인터넷 검색 및 추론 설정을 새 Skill 대화에 적용합니다.
pt_br: Aplicar as preferências de web e raciocínio salvas desta Skill em novos chats de Skill.
ru: Применять сохранённые настройки веб-поиска и рассуждений этой Skill в новых чатах Skill.
th: ใช้การตั้งค่าเว็บและการให้เหตุผลที่บันทึกไว้ของ Skill นี้ในแชท Skill ใหม่
tr: Bu Skill için kaydedilmiş web ve akıl yürütme tercihlerini yeni Skill sohbetlerinde uygula.
vi: Áp dụng tùy chọn web và suy luận đã lưu của Skill này trong các cuộc trò chuyện Skill mới.
zh_hans: 在新的 Skill 对话中应用此 Skill 已保存的联网与思考偏好。
zh_hant: 在新的 Skill 對話中套用此 Skill 已儲存的聯網與思考偏好。

source: Requires Save. Unconfirmed legacy Skill preferences inherit the chat defaults.
ar: يتطلب الحفظ. تفضيلات Skill القديمة غير المؤكدة ترث الإعدادات الافتراضية للمحادثة بدلاً من ذلك.
de: Erfordert Speichern. Unbestätigte alte Skill-Einstellungen übernehmen stattdessen die Chat-Standardwerte.
es: Requiere guardar. Las preferencias antiguas de Skill sin confirmar heredan los valores predeterminados del chat.
fr: Nécessite un enregistrement. Les anciennes préférences de Skill non confirmées héritent des valeurs par défaut du chat.
hi: सहेजना आवश्यक है। अपुष्ट पुरानी Skill प्राथमिकताएँ इसके बजाय चैट डिफ़ॉल्ट अपनाती हैं।
id: Perlu disimpan. Preferensi Skill lama yang belum dikonfirmasi akan mengikuti default obrolan.
ja: 保存が必要です。未確認の旧 Skill 設定は、代わりにチャットの既定値を継承します。
ko: 저장해야 적용됩니다. 확인되지 않은 이전 Skill 설정은 대신 채팅 기본값을 따릅니다.
pt_br: Requer salvar. Preferências antigas de Skill não confirmadas herdam os padrões do chat.
ru: Требуется сохранение. Неподтверждённые старые настройки Skill вместо этого наследуют значения по умолчанию из чата.
th: ต้องบันทึกก่อน การตั้งค่า Skill เดิมที่ยังไม่ยืนยันจะใช้ค่าเริ่มต้นของแชทแทน
tr: Kaydetmek gerekir. Onaylanmamış eski Skill tercihleri bunun yerine sohbet varsayılanlarını devralır.
vi: Cần lưu để áp dụng. Tùy chọn Skill cũ chưa xác nhận sẽ dùng giá trị mặc định của cuộc trò chuyện.
zh_hans: 需要保存后生效。未确认的旧版 Skill 偏好将改用聊天默认值。
zh_hant: 需要儲存後生效。未確認的舊版 Skill 偏好將改用聊天預設值。
